docs/concept/TRACEX-159-concept-handle-duplicated-connector-registrations/TRACEX-159-concept-handle-duplicated-connector-registrations.md
```mermaid
sequenceDiagram
    actor User
    User ->> DiscoveryServiceImpl: getDiscoveryByBPN(bpn)
    activate DiscoveryServiceImpl

    alt try
        DiscoveryServiceImpl ->> DiscoveryRepository: retrieveDiscoveryByFinderAndEdcDiscoveryService(bpn)
        activate DiscoveryRepository
        DiscoveryRepository -->> DiscoveryServiceImpl: Optional<Discovery>
        deactivate DiscoveryRepository
    else catch
        DiscoveryServiceImpl -->> User: throw DiscoveryFinderException("DiscoveryFinder could not determine result.")
    end

    DiscoveryServiceImpl ->> DiscoveryServiceImpl: checkDuplicateUrlsForBpn
    alt Duplicate URLs registered for BPN
        DiscoveryServiceImpl -->> User: throw DiscoveryFinderException
        Note left of User: DiscoveryFinder detected an invalid state:\nMultiple identical URLs have been registered\nfor the same BPN. Ensure each BPN has a unique URL.
    else No duplicates
        DiscoveryServiceImpl -->> DiscoveryServiceImpl: return false
    end

    Note left of DiscoveryServiceImpl: Check if duplicate URLs are registered\nfor the same BPN.

    DiscoveryServiceImpl ->> DiscoveryServiceImpl: getDiscoveryFromBpnDatabase(bpn)
    DiscoveryServiceImpl ->> BpnRepository: existsWhereUrlNotNull(bpn)

    alt BpnEdcMapping exists
        BpnRepository -->> DiscoveryServiceImpl: return BpnEdcMapping
    else BPN not found
        DiscoveryServiceImpl -->> User: throw BpnNotFoundException
    end
    activate BpnRepository
    BpnRepository -->> DiscoveryServiceImpl: boolean
    deactivate BpnRepository

    alt BPN exists and URL is not null
        DiscoveryServiceImpl ->> BpnRepository: findByIdOrThrowNotFoundException(bpn)
        Note left of DiscoveryServiceImpl: If BpnNotFoundException is thrown,\nthe BPN URL from DiscoveryService\nis never used.
        activate BpnRepository
        BpnRepository -->> DiscoveryServiceImpl: BpnRecord
        deactivate BpnRepository
        DiscoveryServiceImpl ->> Discovery: toDiscovery(receiverUrl, senderUrl)
    else DiscoveryFinderException occurs
        DiscoveryServiceImpl -->> User: throw DiscoveryFinderException
    end

    activate Discovery
    DiscoveryServiceImpl ->> DiscoveryServiceImpl: mergeDiscoveriesAndRemoveDuplicates
    DiscoveryServiceImpl ->> DiscoveryServiceImpl: removeDuplicates
    deactivate Discovery

    deactivate DiscoveryServiceImpl

```
